DotBots/DotBot-firmware/bsp/nrf52833/lh2.c
    // Configure the SPIM peripheral
    NRF_SPIM3->FREQUENCY = SPIM_FREQUENCY_FREQUENCY_M32;                         // Set SPI frequency to 32MHz
    NRF_SPIM3->CONFIG    = SPIM_CONFIG_ORDER_MsbFirst << SPIM_CONFIG_ORDER_Pos;  // Set MsB out first

    // Configure the EasyDMA channel
    // Configuring the READER channel
    NRF_SPIM3->RXD.MAXCNT = m_length;            // Set the size of the input buffer.
    NRF_SPIM3->RXD.PTR    = (uint32_t)m_rx_buf;  // Set the input buffer pointer.
    // Configure the WRITER channel
    NRF_SPIM3->TXD.MAXCNT = m_length;            // Set the size of the output buffer.
    NRF_SPIM3->TXD.PTR    = (uint32_t)m_tx_buf;  // Set the output buffer pointer.

    // Enable the SPIM pripheral
    NRF_SPIM3->ENABLE = SPIM_ENABLE_ENABLE_Enabled << SPIM_ENABLE_ENABLE_Pos;

    // Configure the Interruptions
    NVIC_DisableIRQ(SPIM3_IRQn);  // Disable interruptions while configuring

    NRF_SPIM3->INTENSET = SPIM_INTENSET_END_Enabled << SPIM_INTENSET_END_Pos;  // Enable interruption for when a packet arrives
    NVIC_SetPriority(SPIM3_IRQn, SPIM3_INTERRUPT_PRIORITY);                    // Set priority for Radio interrupts to 1
    NVIC_ClearPendingIRQ(SPIM3_IRQn);
    // Enable SPIM interruptions
    NVIC_EnableIRQ(SPIM3_IRQn);

    // Empty the receive buffer
    memset(m_rx_buf, 0, m_length);
    // Reset the Transfer Counter
    TRANSFER_COUNTER = 0;

    // initialize GPIOTEs
    gpiote_setup();
    // initialize timer(s)
    timer2_setup();
    // initialize PPI
    ppi_setup();
}

bool db_get_black_magic(void) {
    uint8_t i;
    uint8_t j;
    // invalid packet detection:
    int8_t invalid_packet_counter;

    if (buffers_ready) {
        buffers_ready = false;

        LH2_bits_sweep_1 = 0;
        LH2_bits_sweep_2 = 0;
        LH2_bits_sweep_3 = 0;
        LH2_bits_sweep_4 = 0;

        // perform the demodulation + poly search on the received packets
        // convert the SPI reading to bits via zero-crossing counter demodulation and differential/biphasic manchester decoding
        LH2_bits_sweep_1 = db_lh2_demodulate_light(stored_buff_1);
        LH2_bits_sweep_2 = db_lh2_demodulate_light(stored_buff_2);
        LH2_bits_sweep_3 = db_lh2_demodulate_light(stored_buff_3);
        LH2_bits_sweep_4 = db_lh2_demodulate_light(stored_buff_4);

        // figure out which polynomial each one of the two samples come from.
        LH2_selected_poly_1 = LH2_determine_polynomial(LH2_bits_sweep_1, &LH2_bit_offset_1);
        LH2_selected_poly_2 = LH2_determine_polynomial(LH2_bits_sweep_2, &LH2_bit_offset_2);
        LH2_selected_poly_3 = LH2_determine_polynomial(LH2_bits_sweep_3, &LH2_bit_offset_3);
        LH2_selected_poly_4 = LH2_determine_polynomial(LH2_bits_sweep_4, &LH2_bit_offset_4);

        temp1 = LH2_selected_poly_1;  // "temp" are global variables used for debugging purposes
        temp2 = LH2_selected_poly_2;
        temp3 = LH2_bit_offset_1;
        temp4 = LH2_bit_offset_2;

        if ((LH2_selected_poly_1 == LH2_POLYNOMIAL_ERROR_INDICATOR) |
            (LH2_selected_poly_2 == LH2_POLYNOMIAL_ERROR_INDICATOR) |
            (LH2_selected_poly_3 == LH2_POLYNOMIAL_ERROR_INDICATOR) |
            (LH2_selected_poly_4 == LH2_POLYNOMIAL_ERROR_INDICATOR)) {  // failure to find one of the two polynomials - start from scratch and grab another capture
            TRANSFER_COUNTER = 0;
            db_lh2_start_transfer();
            return false;
        } else {
            // find location of the first data set by counting the LFSR backwards
            if (LH2_selected_poly_1 == 0) {  // TODO: functionalize this nested if statement to clean up the main/applet code
                LH2_LFSR_location_1 = reverse_count_p0(LH2_bits_sweep_1 >> (47 - LH2_bit_offset_1)) - LH2_bit_offset_1;
            } else if (LH2_selected_poly_1 == 1) {
                LH2_LFSR_location_1 = reverse_count_p1(LH2_bits_sweep_1 >> (47 - LH2_bit_offset_1)) - LH2_bit_offset_1;
            } else if (LH2_selected_poly_1 == 2) {
                LH2_LFSR_location_1 = reverse_count_p2(LH2_bits_sweep_1 >> (47 - LH2_bit_offset_1)) - LH2_bit_offset_1;
            } else if (LH2_selected_poly_1 == 3) {
                LH2_LFSR_location_1 = reverse_count_p3(LH2_bits_sweep_1 >> (47 - LH2_bit_offset_1)) - LH2_bit_offset_1;
            }
            // find location of the second data set
            if (LH2_selected_poly_2 == 0) {
                LH2_LFSR_location_2 = reverse_count_p0(LH2_bits_sweep_2 >> (47 - LH2_bit_offset_2)) - LH2_bit_offset_2;
            } else if (LH2_selected_poly_2 == 1) {
                LH2_LFSR_location_2 = reverse_count_p1(LH2_bits_sweep_2 >> (47 - LH2_bit_offset_2)) - LH2_bit_offset_2;
            } else if (LH2_selected_poly_2 == 2) {
                LH2_LFSR_location_2 = reverse_count_p2(LH2_bits_sweep_2 >> (47 - LH2_bit_offset_2)) - LH2_bit_offset_2;
            } else if (LH2_selected_poly_2 == 3) {
                LH2_LFSR_location_2 = reverse_count_p3(LH2_bits_sweep_2 >> (47 - LH2_bit_offset_2)) - LH2_bit_offset_2;
            }

            // find location of the third data set
            if (LH2_selected_poly_3 == 0) {
                LH2_LFSR_location_3 = reverse_count_p0(LH2_bits_sweep_3 >> (47 - LH2_bit_offset_3)) - LH2_bit_offset_3;
            } else if (LH2_selected_poly_3 == 1) {
                LH2_LFSR_location_3 = reverse_count_p1(LH2_bits_sweep_3 >> (47 - LH2_bit_offset_3)) - LH2_bit_offset_3;
            } else if (LH2_selected_poly_3 == 2) {
                LH2_LFSR_location_3 = reverse_count_p2(LH2_bits_sweep_3 >> (47 - LH2_bit_offset_3)) - LH2_bit_offset_3;
            } else if (LH2_selected_poly_3 == 3) {
                LH2_LFSR_location_3 = reverse_count_p3(LH2_bits_sweep_3 >> (47 - LH2_bit_offset_3)) - LH2_bit_offset_3;
            }

            // find location of the fourth data set
            if (LH2_selected_poly_4 == 0) {
                LH2_LFSR_location_4 = reverse_count_p0(LH2_bits_sweep_4 >> (47 - LH2_bit_offset_4)) - LH2_bit_offset_4;
            } else if (LH2_selected_poly_4 == 1) {
                LH2_LFSR_location_4 = reverse_count_p1(LH2_bits_sweep_4 >> (47 - LH2_bit_offset_4)) - LH2_bit_offset_4;
            } else if (LH2_selected_poly_4 == 2) {
                LH2_LFSR_location_4 = reverse_count_p2(LH2_bits_sweep_4 >> (47 - LH2_bit_offset_4)) - LH2_bit_offset_4;
            } else if (LH2_selected_poly_4 == 3) {
                LH2_LFSR_location_4 = reverse_count_p3(LH2_bits_sweep_4 >> (47 - LH2_bit_offset_4)) - LH2_bit_offset_4;
            }
        }

        // SEND A PACKET???
        spi_xfer_done = 0;  // TODO: figure out if this does anything... I'm not convinced that this does anything

        // packet structure:
        // packet[0] is the robot #
        // packet[1-4] are the results from the four sweeps organized in 32-bit chunks as follows:
        //        env. duration                    poly #                             location in LFSR
        // [  -  -  -  -  -  -  -  -  -  -  |  -  -  -  -  -  |  -  -  -  -  -  -  -  -  -  -  -  -  -  -  -  -  -  ]
        //           10 bits                       5 bits                               17 bits (max)
        //
        lh2_packet[0] = I_AM_ROBOT;
        lh2_packet[1] = ((LH2_envelope_duration_1 & 0x000003FF) << 22) | ((LH2_selected_poly_1 & 0x0000001F) << 17) | ((LH2_LFSR_location_1 & 0x0001FFFF));
        lh2_packet[2] = ((LH2_envelope_duration_2 & 0x000003FF) << 22) | ((LH2_selected_poly_2 & 0x0000001F) << 17) | ((LH2_LFSR_location_2 & 0x0001FFFF));
        lh2_packet[3] = ((LH2_envelope_duration_3 & 0x000003FF) << 22) | ((LH2_selected_poly_3 & 0x0000001F) << 17) | ((LH2_LFSR_location_3 & 0x0001FFFF));
        lh2_packet[4] = ((LH2_envelope_duration_4 & 0x000003FF) << 22) | ((LH2_selected_poly_4 & 0x0000001F) << 17) | ((LH2_LFSR_location_4 & 0x0001FFFF));

        lh2_results[0] = (uint32_t)LH2_selected_poly_1;
        lh2_results[2] = (uint32_t)LH2_selected_poly_2;
        lh2_results[4] = (uint32_t)LH2_selected_poly_3;
        lh2_results[6] = (uint32_t)LH2_selected_poly_4;
        lh2_results[1] = LH2_LFSR_location_1;
        lh2_results[3] = LH2_LFSR_location_2;
        lh2_results[5] = LH2_LFSR_location_3;
        lh2_results[7] = LH2_LFSR_location_4;

        // detect invalid packets
        invalid_packet_counter = 0;
        for (i = 0; i < 7; i += 2) {
            if ((lh2_results[i] == 0) | (lh2_results[i] == 1)) {
                invalid_packet_counter++;  // from LHA
            } else if ((lh2_results[i] == 2) | (lh2_results[i] == 3)) {
                invalid_packet_counter--;  // from LHB
            }
        }
        if ((invalid_packet_counter == 1) | (invalid_packet_counter == -1)) {
            return false;  // odd # of packets from 1 LH, erroneous result
        }

        if ((invalid_packet_counter == 4) | (invalid_packet_counter == -4)) {
            // results from one LH2 were discovered - sort the two pairs
            if (LH2_LFSR_location_1 > LH2_LFSR_location_2) {
                lh2_results[0] = (uint32_t)LH2_selected_poly_2;
                lh2_results[2] = (uint32_t)LH2_selected_poly_1;
                lh2_results[1] = LH2_LFSR_location_2;
                lh2_results[3] = LH2_LFSR_location_1;
            } else {
                lh2_results[0] = (uint32_t)LH2_selected_poly_1;
                lh2_results[2] = (uint32_t)LH2_selected_poly_2;
                lh2_results[1] = LH2_LFSR_location_1;
                lh2_results[3] = LH2_LFSR_location_2;
            }
            if (LH2_LFSR_location_3 > LH2_LFSR_location_4) {
                lh2_results[0] = (uint32_t)LH2_selected_poly_4;
                lh2_results[2] = (uint32_t)LH2_selected_poly_3;
                lh2_results[1] = LH2_LFSR_location_4;
                lh2_results[3] = LH2_LFSR_location_3;
            } else {
                lh2_results[0] = (uint32_t)LH2_selected_poly_3;
                lh2_results[2] = (uint32_t)LH2_selected_poly_4;
                lh2_results[1] = LH2_LFSR_location_3;
                lh2_results[3] = LH2_LFSR_location_4;
            }
        }

