DotBots/DotBot-firmware/bsp/nrf52833/lh2.c
        memset(stored_buff_1, 0, sizeof(stored_buff_1));
        memset(stored_buff_2, 0, sizeof(stored_buff_2));
        memset(stored_buff_3, 0, sizeof(stored_buff_3));
        memset(stored_buff_4, 0, sizeof(stored_buff_4));

        return true;
    }
    return false;
}

void db_get_current_location(uint32_t *position) {
    memcpy(position, lh2_results, 8 * sizeof(uint32_t));
    TRANSFER_COUNTER = 0;
    ready            = false;
    db_lh2_start_transfer();
}

void db_lh2_start_transfer(void) {
    NRF_PPI->CHENSET = (PPI_CHENSET_CH2_Enabled << PPI_CHENSET_CH2_Pos) |
                       //(PPI_CHENSET_CH3_Enabled << PPI_CHENSET_CH3_Pos);
                       (PPI_CHENSET_CH4_Enabled << PPI_CHENSET_CH4_Pos) |
                       (PPI_CHENSET_CH5_Enabled << PPI_CHENSET_CH5_Pos);
}

//=========================== private =========================================

/**
 * @brief wiggle the data and envelope lines in a magical way to configure the TS4231 to continuously read for LH2 sweep signals.
 *
 */
void db_lh2_initialize_ts4231(void) {

    // Configure the wait timer
    db_timer_hf_init();

    // Filip's code define these pins as inputs, and then changes them quickly to outputs. Not sure why, but it works.
    lh2_pin_set_input(D_pin);
    lh2_pin_set_input(E_pin);

    // start the TS4231 initialization
    // Wiggle the Envelope and Data pins
    lh2_pin_set_output(E_pin);
    db_timer_hf_delay_us(10);
    NRF_P0->OUTSET = 1 << E_pin;  // set pin HIGH
    db_timer_hf_delay_us(10);
    NRF_P0->OUTCLR = 1 << E_pin;  // set pin LOW
    db_timer_hf_delay_us(10);
    NRF_P0->OUTSET = 1 << E_pin;
    db_timer_hf_delay_us(10);
    lh2_pin_set_output(D_pin);
    db_timer_hf_delay_us(10);
    NRF_P0->OUTSET = 1 << D_pin;
    db_timer_hf_delay_us(10);
    // Turn the pins back to inputs
    lh2_pin_set_input(D_pin);
    lh2_pin_set_input(E_pin);
    // finally, wait 1 milisecond
    db_timer_hf_delay_us(1000);

    // Send the configuration magic number/sequence
    uint16_t config_val = 0x392B;
    // Turn the Data and Envelope lines back to outputs and clear them.
    lh2_pin_set_output(E_pin);
    lh2_pin_set_output(D_pin);
    db_timer_hf_delay_us(10);
    NRF_P0->OUTCLR = 1 << D_pin;
    db_timer_hf_delay_us(10);
    NRF_P0->OUTCLR = 1 << E_pin;
    db_timer_hf_delay_us(10);
    // Send the magic configuration value, MSB first.
    for (uint8_t i = 0; i < 15; i++) {

        config_val = config_val << 1;
        if ((config_val & 0x8000) > 0)
            NRF_P0->OUTSET = 1 << D_pin;
        else
            NRF_P0->OUTCLR = 1 << D_pin;

        // Toggle the Envelope line as a clock.
        db_timer_hf_delay_us(10);
        NRF_P0->OUTSET = 1 << E_pin;
        db_timer_hf_delay_us(10);
        NRF_P0->OUTCLR = 1 << E_pin;
        db_timer_hf_delay_us(10);
    }
    // Finish send sequence and turn pins into inputs again.
    NRF_P0->OUTCLR = 1 << D_pin;
    db_timer_hf_delay_us(10);
    NRF_P0->OUTSET = 1 << E_pin;
    db_timer_hf_delay_us(10);
    NRF_P0->OUTSET = 1 << D_pin;
    db_timer_hf_delay_us(10);
    lh2_pin_set_input(D_pin);
    lh2_pin_set_input(E_pin);
    // Finish by waiting 10usec
    db_timer_hf_delay_us(10);

    // Now read back the sequence that the TS4231 answers.
    lh2_pin_set_output(E_pin);
    lh2_pin_set_output(D_pin);
    db_timer_hf_delay_us(10);
    NRF_P0->OUTCLR = 1 << D_pin;
    db_timer_hf_delay_us(10);
    NRF_P0->OUTCLR = 1 << E_pin;
    db_timer_hf_delay_us(10);
    NRF_P0->OUTSET = 1 << D_pin;
    db_timer_hf_delay_us(10);
    NRF_P0->OUTSET = 1 << E_pin;
    db_timer_hf_delay_us(10);
    // Set Data pin as an input, to receive the data
    lh2_pin_set_input(D_pin);
    db_timer_hf_delay_us(10);
    NRF_P0->OUTCLR = 1 << E_pin;
    db_timer_hf_delay_us(10);
    // Use the Envelope pin to output a clock while the data arrives.
    for (uint8_t i = 0; i < 14; i++) {

        NRF_P0->OUTSET = 1 << E_pin;
        db_timer_hf_delay_us(10);
        NRF_P0->OUTCLR = 1 << E_pin;
        db_timer_hf_delay_us(10);
    }

    // Finish the configuration procedure
    lh2_pin_set_output(D_pin);
    db_timer_hf_delay_us(10);
    NRF_P0->OUTSET = 1 << E_pin;
    db_timer_hf_delay_us(10);
    NRF_P0->OUTSET = 1 << D_pin;
    db_timer_hf_delay_us(10);

    NRF_P0->OUTCLR = 1 << E_pin;
    db_timer_hf_delay_us(10);
    NRF_P0->OUTCLR = 1 << D_pin;
    db_timer_hf_delay_us(10);
    NRF_P0->OUTSET = 1 << E_pin;
    db_timer_hf_delay_us(10);

    lh2_pin_set_input(D_pin);
    lh2_pin_set_input(E_pin);

    db_timer_hf_delay_us(50000);

    //NRF_TIMER3->TASKS_STOP = (1UL);
}

/**
 * @brief
 * @param sample_buffer: SPI samples loaded into a local buffer
 * @return chipsH: 64-bits of demodulated data
 */
uint64_t db_lh2_demodulate_light(uint8_t *sample_buffer) {  // bad input variable name!!
    // TODO: rename sample_buffer
    // TODO: make it a void and have chips be a modified pointer thingie
    // FIXME: there is an edge case where I throw away an initial "1" and do not count it in the bit-shift offset, resulting in an incorrect error of 1 in the LFSR location
    uint8_t chip_index;
    uint8_t local_buffer[128];
    uint8_t zccs_1[128];
    uint8_t chips1[128];  // TODO: give this a better name.
    uint8_t temp_byte_N;  // TODO: bad variable name "temp byte"
    uint8_t temp_byte_M;  // TODO: bad variable name "temp byte"

    // initialize loop variables
    uint8_t  ii = 0x00;
    int      jj = 0;
    int      kk = 0;
    uint64_t gg = 0;

    // initialize temporary "ones counter" variable that counts consecutive ones
    int ones_counter = 0;

    // initialize result:
    uint64_t chipsH1 = 0;

    // FIND ZERO CROSSINGS
    chip_index         = 0;
    zccs_1[chip_index] = 0x01;

    memcpy(local_buffer, sample_buffer, 128);

    // for loop over bytes of the SPI buffer (jj), nested with a for loop over bits in each byte (ii)
    for (jj = 0; jj < 128; jj++) {
        // edge case - check if last bit (LSB) of previous byte is the same as first bit (MSB) of current byte
        // if it is not, increment chip_index and reset count
        if (jj != 0) {
            temp_byte_M = (local_buffer[jj - 1]) & (0x01);   // previous byte's LSB
            temp_byte_N = (local_buffer[jj] >> 7) & (0x01);  // current byte's MSB
            if (temp_byte_M != temp_byte_N) {
                chip_index++;
                zccs_1[chip_index] = 1;
            } else {
                zccs_1[chip_index] += 1;
            }
        }
        // look at one byte at a time
        for (ii = 7; ii > 0; ii--) {
            temp_byte_M = ((local_buffer[jj]) >> (ii)) & (0x01);      // bit shift by ii and mask
            temp_byte_N = ((local_buffer[jj]) >> (ii - 1)) & (0x01);  // bit shift by ii-1 and mask
            if (temp_byte_M == temp_byte_N) {
                zccs_1[chip_index] += 1;
            } else {
                chip_index++;
                zccs_1[chip_index] = 1;
            }
        }
    }

