DotBots/DotBot-firmware/bsp/nrf52833/lh2.c
    uint8_t  ii          = 0;  // loop variable for cumulative sum
    uint32_t result      = 0;
    uint32_t b17         = 0;
    uint32_t masked_buff = 0;
    uint32_t poly        = 0b10011111101100111;
    while (buffer != end_buffer0)  // do until buffer reaches one of the saved states
    {
        b17         = buffer & 0x00000001;           // save the "newest" bit of the buffer
        buffer      = (buffer & (0x0001FFFE)) >> 1;  // shift the buffer right, backwards in time
        masked_buff = (buffer) & (poly);             // mask the buffer w/ the selected polynomial
        for (ii = 0; ii < 17; ii++) {
            result = result ^ (((masked_buff) >> ii) & (0x00000001));  // cumulative sum of buffer&poly
        }
        result = result ^ b17;
        buffer = buffer | (result << 16);  // update buffer w/ result
        result = 0;                        // reset result
        count++;
        if ((buffer ^ end_buffer1) == 0x00000000) {
            count  = count + 8192 - 1;
            buffer = end_buffer0;
        }
        if ((buffer ^ end_buffer2) == 0x00000000) {
            count  = count + 16384 - 1;
            buffer = end_buffer0;
        }
        if ((buffer ^ end_buffer3) == 0x00000000) {
            count  = count + 24576 - 1;
            buffer = end_buffer0;
        }
        if ((buffer ^ end_buffer4) == 0x00000000) {
            count  = count + 32768 - 1;
            buffer = end_buffer0;
        }
        if ((buffer ^ end_buffer5) == 0x00000000) {
            count  = count + 40960 - 1;
            buffer = end_buffer0;
        }
        if ((buffer ^ end_buffer6) == 0x00000000) {
            count  = count + 49152 - 1;
            buffer = end_buffer0;
        }
        if ((buffer ^ end_buffer7) == 0x00000000) {
            count  = count + 57344 - 1;
            buffer = end_buffer0;
        }
        if ((buffer ^ end_buffer8) == 0x00000000) {
            count  = count + 65536 - 1;
            buffer = end_buffer0;
        }
        if ((buffer ^ end_buffer9) == 0x00000000) {
            count  = count + 73728 - 1;
            buffer = end_buffer0;
        }
        if ((buffer ^ end_buffer10) == 0x00000000) {
            count  = count + 81920 - 1;
            buffer = end_buffer0;
        }
        if ((buffer ^ end_buffer11) == 0x00000000) {
            count  = count + 90112 - 1;
            buffer = end_buffer0;
        }
        if ((buffer ^ end_buffer12) == 0x00000000) {
            count  = count + 98304 - 1;
            buffer = end_buffer0;
        }
        if ((buffer ^ end_buffer13) == 0x00000000) {
            count  = count + 106496 - 1;
            buffer = end_buffer0;
        }
        if ((buffer ^ end_buffer14) == 0x00000000) {
            count  = count + 114688 - 1;
            buffer = end_buffer0;
        }
        if ((buffer ^ end_buffer15) == 0x00000000) {
            count  = count + 122880 - 1;
            buffer = end_buffer0;
        }
    }
    return count;
}

// setup the PPI
/**
 * @brief start SPI3 at falling edge of envelope, start timer2 at falling edge of envelope, stop/capture timer2 at rising edge of envelope
 *
 */
void ppi_setup(void) {
    // uint32_t gpiote_output_task_addr  = (uint32_t)&NRF_GPIOTE->TASKS_OUT[GPIOTE_CH_OUT];
    uint32_t gpiote_input_task_addr   = (uint32_t)&NRF_GPIOTE->EVENTS_IN[GPIOTE_CH_IN_ENV_HiToLo];
    uint32_t envelope_input_LoToHi    = (uint32_t)&NRF_GPIOTE->EVENTS_IN[GPIOTE_CH_IN_ENV_LoToHi];
    uint32_t spi3_start_task_addr     = (uint32_t)&NRF_SPIM3->TASKS_START;
    uint32_t spi3_stop_task_addr      = (uint32_t)&NRF_SPIM3->TASKS_STOP;
    uint32_t timer2_start_task_addr   = (uint32_t)&NRF_TIMER2->TASKS_START;
    uint32_t timer2_stop_task_addr    = (uint32_t)&NRF_TIMER2->TASKS_STOP;
    uint32_t timer2_capture_task_addr = (uint32_t)&NRF_TIMER2->TASKS_CAPTURE[0];
    uint32_t timer2_clear_task_addr   = (uint32_t)&NRF_TIMER2->TASKS_CLEAR;

    NRF_PPI->CH[2].EEP   = gpiote_input_task_addr;  // envelope down
    NRF_PPI->CH[2].TEP   = spi3_start_task_addr;    // start spi3 transfer
    NRF_PPI->FORK[2].TEP = timer2_start_task_addr;  // start timer

    // NRF_PPI->CH[3].EEP    = gpiote_input_task_addr;
    // NRF_PPI->CH[3].TEP    = gpiote_output_task_addr;

    NRF_PPI->CH[4].EEP   = envelope_input_LoToHi;     // envelope up, finished lh2 data
    NRF_PPI->CH[4].TEP   = timer2_capture_task_addr;  // get time it took
    NRF_PPI->FORK[4].TEP = timer2_stop_task_addr;     // stop timer

    NRF_PPI->CH[5].EEP   = envelope_input_LoToHi;
    NRF_PPI->CH[5].TEP   = timer2_clear_task_addr;  // clear timer
    NRF_PPI->FORK[5].TEP = spi3_stop_task_addr;     // stop spi3 transfer
}

/**
 * @brief timer2 setup, in ppi_setup() this timer will CLEAR/START at falling edge of envelop signal and STOP/CAPTURE at rising edge of envelope signal
 *
 */
void timer2_setup(void) {
    NRF_TIMER2->BITMODE   = TIMER_BITMODE_BITMODE_32Bit;
    NRF_TIMER2->PRESCALER = (0UL);  // 16 MHz clock counter

    // timer will START at falling edge of the envelope signal
    // timer will STOP at rising edge of the envelope signal
    // it is the processor's responsibility to read this timer's count value and reset it
}

/**
 * @brief SPIM3 interrupt handler
 *
 */
void SPIM3_IRQHandler(void) {
    NVIC_ClearPendingIRQ(SPIM3_IRQn);

    spi_xfer_done = true;
    ready         = false;
    TRANSFER_COUNTER++;

    volatile int lp = 0;  // temporary loop variable to go through each byte of the SPI buffer

    // Check if the interrupt was caused by a fully send package
    if (NRF_SPIM3->EVENTS_END) {

        // Clear the Interrupt flag
        NRF_SPIM3->EVENTS_END = 0;

        // load global SPI buffer (m_rx_buf) into four local arrays (stored_buff_1 ... stored_buff_4)
        if (TRANSFER_COUNTER == 1) {
            for (lp = 0; lp < m_length; lp++) {
                stored_buff_1[lp] = m_rx_buf[lp];
                m_rx_buf[lp]      = 0x00;
            }
            LH2_envelope_duration_1 = NRF_TIMER2->CC[0];
        } else if (TRANSFER_COUNTER == 2) {
            for (lp = 0; lp < m_length; lp++) {
                stored_buff_2[lp] = m_rx_buf[lp];
                m_rx_buf[lp]      = 0x00;
            }
            LH2_envelope_duration_2 = NRF_TIMER2->CC[0];
        } else if (TRANSFER_COUNTER == 3) {
            for (lp = 0; lp < m_length; lp++) {
                stored_buff_3[lp] = m_rx_buf[lp];
                m_rx_buf[lp]      = 0x00;
            }
            LH2_envelope_duration_3 = NRF_TIMER2->CC[0];
        } else if (TRANSFER_COUNTER == 4) {
            for (lp = 0; lp < m_length; lp++) {
                stored_buff_4[lp] = m_rx_buf[lp];
                m_rx_buf[lp]      = 0x00;
            }
            LH2_envelope_duration_4 = NRF_TIMER2->CC[0];
            NRF_PPI->CHENCLR        = (PPI_CHENCLR_CH2_Enabled << PPI_CHENCLR_CH2_Pos) |
                               //(PPI_CHENCLR_CH3_Enabled << PPI_CHENCLR_CH3_Pos);
                               (PPI_CHENCLR_CH4_Enabled << PPI_CHENCLR_CH4_Pos) |
                               (PPI_CHENCLR_CH5_Enabled << PPI_CHENCLR_CH5_Pos);  // stop receiving data while it thinks
            buffers_ready = true;
        }
    }
}

/**
 * @brief set-up GPIOTE so that events are configured for falling (GPIOTE_CH_IN) and rising edges (GPIOTE_CH_IN_ENV_HiToLo) of the envelope signal
 *
 */
void gpiote_setup(void) {

